In [1]:
import pandas as pd

In [2]:
fields=['Sexo Trabalhador','Vl Remun Média Nom']
fieldsnum = [37,8,34]

In [3]:
df_norte = pd.read_csv("RAIS_VINC_PUB_NORTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [4]:
#df_norte=df_norte.loc[df_norte['CNAE 2.0 Classe']==62040]

In [4]:
df_norte.shape

(3700916, 3)

In [5]:
df_norte['valor'] = df_norte['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )

In [7]:
df_norte.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [19]:
df_norte

         Sexo Trabalhador     valor
0                       1    455.07
1                       1   1435.58
2                       1    384.33
3                       1   1218.74
4                       1   1369.83
...                   ...       ...
3700911                 2   4488.84
3700912                 2  10498.09
3700913                 2  10993.47
3700914                 2  10690.56
3700915                 2    879.11

[3700916 rows x 2 columns]

In [9]:
df_nordeste = pd.read_csv("RAIS_VINC_PUB_NORDESTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fieldsnum,header=None)

In [14]:
df_nordeste.head()

       8             34  37    valor
0  14134  0000001170,76   2  1170.76
1  49302  0000001919,11   2  1919.11
2  49302  0000001575,90   2  1575.90
3  47717  0000002655,65   2  2655.65
4  47717  0000002233,82   2  2233.82

In [23]:
#df_nordeste= df_nordeste.loc[df_nordeste[8]==62040]

In [13]:
df_nordeste['valor'] = df_nordeste[34].map(lambda x: round(float(x.replace(',','.')),2)    )

In [15]:
df_nordeste.drop([8,34], axis=1,inplace=True)

In [16]:
df_nordeste

          37    valor
0          2  1170.76
1          2  1919.11
2          2  1575.90
3          2  2655.65
4          2  2233.82
...       ..      ...
10556195   2  3382.37
10556196   2  4302.99
10556197   2  2485.59
10556198   2  2562.03
10556199   2  1987.00

[10556200 rows x 2 columns]

In [17]:
df_nordeste = df_nordeste.rename(columns = {37: "Sexo Trabalhador"})

In [18]:
df_nordeste

          Sexo Trabalhador    valor
0                        2  1170.76
1                        2  1919.11
2                        2  1575.90
3                        2  2655.65
4                        2  2233.82
...                    ...      ...
10556195                 2  3382.37
10556196                 2  4302.99
10556197                 2  2485.59
10556198                 2  2562.03
10556199                 2  1987.00

[10556200 rows x 2 columns]

In [23]:
df_centro = pd.read_csv("RAIS_VINC_PUB_CENTRO_OESTE.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [24]:
df_centro

         CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   2209      0000001113,46                 1
1                  41107      0000001100,00                 1
2                  16102      0000001121,00                 1
3                  10651      0000002092,57                 1
4                  22226      0000001722,74                 1
...                  ...                ...               ...
6161933            86402      0000011214,70                 2
6161934            94995      0000013645,18                 2
6161935            94995      0000010619,59                 2
6161936            86402      0000008675,59                 2
6161937            94201      0000011995,82                 2

[6161938 rows x 3 columns]

In [22]:
#df_centro=df_centro.loc[df_centro['CNAE 2.0 Classe']==62040]

In [25]:
df_centro['valor'] = df_centro['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    )

In [29]:
df_centro

         Sexo Trabalhador     valor
0                       1   1113.46
1                       1   1100.00
2                       1   1121.00
3                       1   2092.57
4                       1   1722.74
...                   ...       ...
6161933                 2  11214.70
6161934                 2  13645.18
6161935                 2  10619.59
6161936                 2   8675.59
6161937                 2  11995.82

[6161938 rows x 2 columns]

In [28]:
df_centro.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [30]:
df_sudeste = pd.read_csv("RAIS_VINC_PUB_MG_ES_RJ.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [31]:
df_sudeste

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   41204      0000000000,00                 1
1                   41204      0000001749,00                 1
2                   46231      0000001331,76                 1
3                   49302      0000000946,30                 1
4                   15106      0000000845,61                 1
...                   ...                ...               ...
13558496            64620      0000002149,21                 2
13558497            85139      0000003604,79                 2
13558498            85139      0000002768,96                 2
13558499            82113      0000008707,37                 2
13558500            85937      0000003599,02                 2

[13558501 rows x 3 columns]

In [32]:
#df_sudeste=df_sudeste.loc[df_sudeste['CNAE 2.0 Classe']==62040]
df_sudeste['valor'] = df_sudeste['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sudeste.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [33]:
df_sudeste

          Sexo Trabalhador    valor
0                        1     0.00
1                        1  1749.00
2                        1  1331.76
3                        1   946.30
4                        1   845.61
...                    ...      ...
13558496                 2  2149.21
13558497                 2  3604.79
13558498                 2  2768.96
13558499                 2  8707.37
13558500                 2  3599.02

[13558501 rows x 2 columns]

In [34]:
df_sp = pd.read_csv("RAIS_VINC_PUB_SP.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [35]:
df_sp

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   81214      0000001141,23                 1
1                   41204      0000002252,42                 1
2                   56112      0000001109,85                 1
3                   43134      0000001317,67                 1
4                   38114      0000001996,51                 1
...                   ...                ...               ...
18888458            85333      0000006612,52                 2
18888459            69206      0000002254,89                 2
18888460            69206      0000003130,23                 2
18888461            11135      0000002044,61                 2
18888462            85139      0000007943,63                 2

[18888463 rows x 3 columns]

In [36]:
#df_sp=df_sp.loc[df_sp['CNAE 2.0 Classe']==62040]
df_sp['valor'] = df_sp['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sp.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [37]:
df_sp

          Sexo Trabalhador    valor
0                        1  1141.23
1                        1  2252.42
2                        1  1109.85
3                        1  1317.67
4                        1  1996.51
...                    ...      ...
18888458                 2  6612.52
18888459                 2  2254.89
18888460                 2  3130.23
18888461                 2  2044.61
18888462                 2  7943.63

[18888463 rows x 2 columns]

In [38]:
df_sul = pd.read_csv("RAIS_VINC_PUB_SUL.csv",encoding="ISO-8859-1",delimiter=";", usecols=fields)

In [54]:
df_sul

          CNAE 2.0 Classe Vl Remun Média Nom  Sexo Trabalhador
0                   81290      0000001413,94                 1
1                   35140      0000001353,08                 1
2                   43991      0000001274,25                 1
3                   23427      0000000782,87                 1
4                   45307      0000000000,00                 1
...                   ...                ...               ...
12161305            47717      0000003534,87                 2
12161306            49302      0000002959,74                 2
12161307            87115      0000001565,32                 2
12161308            85996      0000001982,12                 2
12161309            85201      0000003359,37                 2

[12161310 rows x 3 columns]

In [39]:
#df_sul=df_sul.loc[df_sul['CNAE 2.0 Classe']==62040]
df_sul['valor'] = df_sul['Vl Remun Média Nom'].map(lambda x: round(float(x.replace(',','.')),2)    ) 
df_sul.drop(['CNAE 2.0 Classe', 'Vl Remun Média Nom'], axis=1,inplace=True)

In [40]:
df_sul

          Sexo Trabalhador    valor
0                        1  1413.94
1                        1  1353.08
2                        1  1274.25
3                        1   782.87
4                        1     0.00
...                    ...      ...
12161305                 2  3534.87
12161306                 2  2959.74
12161307                 2  1565.32
12161308                 2  1982.12
12161309                 2  3359.37

[12161310 rows x 2 columns]

In [42]:
df=df_nordeste

In [43]:
df_nordeste.shape

(10556200, 2)

In [44]:
df_norte.shape

(3700916, 2)

In [45]:
df = df.append(df_norte)

In [46]:
df.shape

(14257116, 2)

In [47]:
df = df.append(df_sp)

In [48]:
df.shape

(33145579, 2)

In [49]:
df= df.append(df_centro)

In [50]:
df.shape

(39307517, 2)

In [51]:
df = df.append(df_sudeste)

In [52]:
df.shape

(52866018, 2)

In [53]:
df=df.append(df_sul)

In [54]:
df.shape

(65027328, 2)

In [55]:
df['valor3'] = round(df['valor'],0)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 65027328 entries, 0 to 12161309
Data columns (total 3 columns):
 #   Column            Dtype
---  ------            -----
 0   Sexo Trabalhador  int64
 1   valor             float64
 2   valor3            float64
dtypes: float64(2), int64(1)
memory usage: 1.9 GB

In [57]:
result=df.groupby('Sexo Trabalhador')['valor'].mean()

In [58]:
result

Sexo Trabalhador
1    2711.794008
2    2403.906857
Name: valor, dtype: float64

In [116]:
result2 = result.to_frame()

In [117]:
result2.iloc[0]-result2.iloc[1]

valor    1808.974435
dtype: float64

In [41]:
#print(df.shape[0])
print(df_sul.shape[0])
print(df_sudeste.shape[0])
print(df_norte.shape[0])
print(df_nordeste.shape[0])
print(df_centro.shape[0])
print(df_sp.shape[0])

12161310
13558501
3700916
10556200
6161938
18888463